Процедура ПеремешатьМассив(Массив) Экспорт
    
    Генератор = Новый ГенераторСлучайныхЧисел();
	
	Для Шаг1 = 0 По Массив.ВГраница() Цикл
		
		// Определяем случайный элемент массива
        Шаг2 = Генератор.СлучайноеЧисло(0, Массив.ВГраница());
		
		// Меняем местами элеметы массива
        Врем = Массив[Шаг1];
        Массив[Шаг1] = Массив[Шаг2];
        Массив[Шаг2] = Врем;
    КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЦвета(Форма) Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Красный", "red");
	Структура.Вставить("Синий", "blue");
	Структура.Вставить("Зеленый", "green");
	Структура.Вставить("Желтый", "yellow");
	Структура.Вставить("Коричневый", "brown");
	
	Форма.ЦветаСтруктура = Структура;
	
КонецПроцедуры

Функция ПолучитьТекущегоИгрока() Экспорт
	Возврат ПараметрыСеанса.ТекущийИгрок;	
КонецФункции

Процедура ДополнитьПоселениями(Структура) Экспорт

	Для каждого Цвет Из Перечисления.Цвета Цикл
		
		Структура.Вставить("" + Цвет + "Поселение");
	    
	КонецЦикла;

КонецПроцедуры

Процедура ДополнитьГородами(Структура) Экспорт
	
	Для каждого Цвет Из Перечисления.Цвета Цикл
		
		Структура.Вставить("" + Цвет + "Город");
	    
	КонецЦикла;

	
КонецПроцедуры