Процедура ИнициализацияИгровогоПоля(Форма) Экспорт
	
	Текстуры = Текстуры();	
	ЗагрузитьТекстуры(Текстуры);
	ЗагрузитьИзображенияНаПоле(Текстуры, Форма.МакетИгровогоПоля);	
	
	Форма.Текстуры = Текстуры;
	
КонецПроцедуры

Процедура ЗагрузитьТекстуры(Текстуры)
	
	Если Ложь Тогда Текстуры = Новый Структура КонецЕсли;
	
	Для каждого КлючИЗначение Из Текстуры Цикл 
		Попытка
			Картинка = БиблиотекаКартинок[КлючИЗначение.Ключ];
			Текстуры[КлючИЗначение.Ключ] = ПоместитьВоВременноеХранилище(Картинка, Новый УникальныйИдентификатор);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьИзображенияНаПоле(Текстуры, ХТМЛ) 
	
	Для каждого КлючИЗначение Из Текстуры Цикл 
		Попытка
			Ключ = "%" + КлючИЗначение.Ключ + "%"; 
			ХТМЛ = СтрЗаменить(ХТМЛ, Ключ, КлючИЗначение.Значение);
		Исключение 
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция Текстуры()
	
	Структура = Новый Структура;   
	
	// Текстуры
	Структура.Вставить("ТекстураМоря");
	Структура.Вставить("ТекстураДерева");
	
	Структура.Вставить("Порт");
	
	// Сырье
	Структура.Вставить("Глина");
	Структура.Вставить("Камень");
	Структура.Вставить("Пшеница");
	Структура.Вставить("Овца");
	Структура.Вставить("Древесина");
	Структура.Вставить("Любой");
	
	// Дополнительные элементы
	Структура.Вставить("Квадрат");
	Структура.Вставить("СтрелкаВправо");
	Структура.Вставить("СтрелкаВлево");
	
	// кубики
	Для сч=1 По 6 Цикл
	
		Структура.Вставить("ЖелтыйКубик" + сч);
	    Структура.Вставить("КрасныйКубик" + сч);
		
	КонецЦикла;
	
	Структура.Вставить("Разбойник");
	
	Структура.Вставить("ОбщаяКарта");
	Структура.Вставить("Рыцарь");
	
	// поселения
	ОбщийМодульСервер.ДополнитьПоселениями(Структура);
	
	// города
	ОбщийМодульСервер.ДополнитьГородами(Структура);
	
	Возврат Структура;
	
КонецФункции
