 
Процедура ЗаполнитьГексыХТМЛ(Форма)Экспорт
	
	ДанныеГексов = РаботаСЛандшафтамиСервер.ПолучитьГексыХТМЛ();
	
	Для Шаг=1 по 19 Цикл
		
		СтрокаДляПоиска = "" + Шаг + "Number";
		ЗаменитьЖетоны(СтрокаДляПоиска, ДанныеГексов["N" + СтрокаДляПоиска], Форма);
		
		СтрокаДляПоиска = "" + Шаг + "Hex";
		ЗаменитьЛандшафт(СтрокаДляПоиска, ДанныеГексов["H" + СтрокаДляПоиска], Форма);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьЛандшафт (Гекс, Картинка, Форма)
	
	   Форма.getElementById(Гекс).src = Картинка;
	   
КонецПроцедуры   

Процедура ЗаменитьЖетоны (Жетон, НовоеЧисло, Форма)
	
	   Форма.getElementById(Жетон).textContent = НовоеЧисло;
	
КонецПроцедуры