Процедура ИнициализацияГлавногоМеню(Форма) Экспорт
	
	Текстуры = Текстуры();	
	ЗагрузитьТекстуры(Текстуры);
	ЗагрузитьИзображенияНаПоле(Текстуры, Форма.МакетГлавногоМеню);	
	ИнициализацияЦветовВГлавномМеню(Форма.МакетГлавногоМеню);
	
	Форма.Текстуры = Текстуры;   	
	
КонецПроцедуры

Процедура ЗагрузитьТекстуры(Текстуры)
	
	Если Ложь Тогда Текстуры = Новый Структура КонецЕсли;
	
	Для каждого КлючИЗначение Из Текстуры Цикл 
		Попытка
			Картинка = БиблиотекаКартинок[КлючИЗначение.Ключ];
			Текстуры[КлючИЗначение.Ключ] = ПоместитьВоВременноеХранилище(Картинка, Новый УникальныйИдентификатор);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьИзображенияНаПоле(Текстуры, ХТМЛ)
	
	Для каждого КлючИЗначение Из Текстуры Цикл 
		Попытка
			Ключ = "%" + КлючИЗначение.Ключ + "%"; 
			ХТМЛ = СтрЗаменить(ХТМЛ, Ключ, КлючИЗначение.Значение);
		Исключение 
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры 

Функция Текстуры()
	
	Структура = Новый Структура;   
	
	// Фон
	Структура.Вставить("ФонГлавногоМеню");
	
	// Дополнительные элементы
	Структура.Вставить("Квадрат");
	
	Возврат Структура;
	
КонецФункции

Процедура ИнициализацияЦветовВГлавномМеню(ХТМЛ)
	
	// Перебираем все значения перечисления
    СтрокаЦветаХТМЛ = "";

	Для Каждого Цвет Из Перечисления.Цвета Цикл
	    СтрокаЦветаХТМЛ = СтрокаЦветаХТМЛ + "<div><option value=""" + Цвет + """>" + Цвет + "</option></div>" + Символы.ПС;  
	КонецЦикла;
	
	ХТМЛ = СтрЗаменить(ХТМЛ, "%ЦветаИгроков%", СтрокаЦветаХТМЛ);
	
КонецПроцедуры